
def area(a):
    '''
    Вычисляет площадь квадрата.
    
    Параметры:
        a (float): длина стороны квадрата
    
    Возвращаемое значение:
        float: площадь квадрата
    
    Пример:
        >>> area(2)
        4
        >>> area(3)
        9
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата.
    
    Параметры:
        a (float): длина стороны квадрата
    
    Возвращаемое значение:
        float: периметр квадрата
    
    Пример:
        >>> perimeter(2)
        8
        >>> perimeter(3)
        12
    '''
    return 4 * a
